from expert_system import *


rules = {
    'default': Ask(['y','n']),
    'сеттинг': Ask(['прошлое','будущее','настоящее','другое']),
    'атмосфера': Ask(['лёгкий','серьёзный']),
    'фантастика': If(OR(['будущее','фантастические существа','магия'])),
    'мелодрама': If(['про любовь', 'лёгкий']),
    'комедия': If(['лёгкий','весёлый']),
    'темп': Ask(['динамичный','спокойный']),
    'боевик': If(['динамичный','для взрослых']),
    'фильм:сумерки': If(['мелодрама', 'динамичный']),
    'фильм:лалаленд': If(['мелодрама', 'спокойный']),
    'фильм:7психопатов': If(['боевик', 'весёлый']),
    'фильм:бегущий по лезвию': If(['фантастика', 'будущее', 'серьёзный', 'для взрослых']),
    'фильм:реальные упыри': If(['фантастика', 'комедия', 'фантастические существа']),
    'фильм:как женить холостяка': If(['комедия', 'мелодрама']),
    'фильм:властелин колец': If(['фантастика', 'прошлое', OR(['магия', 'фантастические существа'])]),

}